Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: link:/guides/podman[Using Podman with Quarkus]
ja_jp: link:/guides/podman[PodmanとQuarkusの併用]

source: link:/guides/rest-client-reactive[The REST Client Reactive guide]
ja_jp: link:/guides/rest-client-reactive[RESTクライアント・リアクティブガイド]

source: link:/guides/rest-json[Our introduction to writing REST services]
ja_jp: link:/guides/rest-json[RESTサービスの書き方入門]

source: link:/guides/resteasy-reactive-migration[The RESTEasy Reactive migration guide] - again, you can pursue with RESTEasy Classic if you like it!
ja_jp: link:/guides/resteasy-reactive-migration[RESTEasy Reactiveの移行ガイド] - 繰り返しになりますが、あなたが好きなら、RESTEasy Classicを続けることができます!

source: link:/guides/resteasy-reactive[The RESTEasy Reactive reference guide]
ja_jp: link:/guides/resteasy-reactive[RESTEasy Reactiveリファレンスガイド]

source: link:/guides/security-openid-connect-client-reference[OpenId Connect Client Reference Guide]
ja_jp: link:/guides/security-openid-connect-client-reference[OpenId Connect クライアント リファレンスガイド]

source: link:/guides/security-openid-connect-web-authentication#back-channel-logout[Support for OIDC backchannel logout] has been added.
ja_jp: link:/guides/security-openid-connect-web-authentication#back-channel-logout[OIDCのバックチャネルログアウトのサポート] が追加されました。

source: link:/guides/stork-kubernetes[Using Stork with Kubernetes]
ja_jp: link:/guides/stork-kubernetes[KubernetesでStorkを使用する]

source: link:/guides/stork-reference[The Stork Reference]
ja_jp: link:/guides/stork-reference[Storkリファレンス]

source: link:/guides/stork[The Stork guide]
ja_jp: link:/guides/stork[Storkガイド]

source: link:http://hibernate.org/reactive/[Hibernate Reactive] is the only reactive JPA implementation and offers you the full breadth of an Object Relational Mapper allowing you to access your database over reactive drivers. It makes complex mappings possible, but it does not make simple and common mappings trivial. Hibernate Reactive with Panache focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: link:http://hibernate.org/reactive/[Hibernate Reactive] は唯一のリアクティブなJPA実装で、リアクティブドライバでデータベースにアクセスできるオブジェクトリレーショナルマッパーの全機能を提供します。 複雑なマッピングを可能にしますが、単純で一般的なマッピングを簡単にするものではありません。 Hibernate Reactive with Panacheは、Quarkusでエンティティを簡単に楽しく書けるようにすることに重点を置いています。

source: link:https://auth0.com/docs/[Auth0 docs site]
ja_jp: link:https://auth0.com/docs/[Auth0 のドキュメントサイト]

source: link:https://brew.sh/[Homebrew] is a popular choice among macOS users to install and manage binaries. Homebrew packages are at their core a Ruby file (known as a formula) that's executed on the target environment to install or upgrade a particular binary. JReleaser can create formulae from binary distributions such as the one we already have configured.
ja_jp: link:https://brew.sh/[Homebrew] は、バイナリーをインストールおよび管理するための macOS ユーザーの間で人気のある選択肢です。Homebrew パッケージは、特定のバイナリーをインストールまたはアップグレードするためにターゲット環境で実行される Ruby ファイル (フォーミュラと呼ばれる) をコアにしています。JReleaser は、すでに設定したようなバイナリー分布から数式を作成できます。

source: link:https://datatracker.ietf.org/doc/html/rfc7636[Proof Key for Code Exchange] (PKCE) minimizes the risk of authorization code interception.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc7636[Proof Key for Code Exchange] (PKCE) は、認可コードの傍受のリスクを最小限に抑えます。

source: link:https://datatracker.ietf.org/doc/html/rfc7636[Proof Of Key for Code Exchange] (PKCE) minimizes the risk of the authorization code interception.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc7636[Proof Of Key for Code Exchange] (PKCE) は、認可コードの傍受のリスクを最小限に抑えます。

source: link:https://datatracker.ietf.org/doc/html/rfc9126[OAuth 2.0 Pushed Authorization Requests] (PAR) allows the authorization server to authenticate the client before any user interaction happens. It mitigates front-channel attacks by preventing malicious actors from intercepting, tampering with, or spoofing the authorization request details in the user's browser.
ja_jp: link:https://datatracker.ietf.org/doc/html/rfc9126[OAuth 2.0 Pushed Authorization Requests] (PAR) を使用すると、ユーザー操作が行われる前に認可サーバーがクライアントを認証できます。これにより、悪意のあるアクターがユーザーのブラウザーで認可リクエストの詳細を傍受、改ざん、または偽装するのを防ぎ、フロントチャネル攻撃を軽減します。

source: link:https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS[Mozilla HTTP CORS documentation]
ja_jp: link:https://developer.mozilla.org/en-US/docs/Web/HTTP/CORS[Mozilla HTTP CORS ドキュメント]

source: link:https://developers.google.com/style/person?hl=en[Second person (you)]
ja_jp: link:https://developers.google.com/style/person?hl=en[二人称（あなた）]

source: link:https://developers.google.com/style/pronouns?hl=en[Gender neutral language]
ja_jp: link:https://developers.google.com/style/pronouns?hl=en[性中立的言語]

source: link:https://developers.google.com/style/tense?hl=en[Present tense]
ja_jp: link:https://developers.google.com/style/tense?hl=en[現在形]

source: link:https://developers.google.com/style/tone?hl=en[A conversational tone]
ja_jp: link:https://developers.google.com/style/tone?hl=en[会話調]

source: link:https://developers.google.com/style/voice?hl=en[Active voice]
ja_jp: link:https://developers.google.com/style/voice?hl=en[能動態]

source: link:https://docs.gradle.org/current/userguide/build_cache.html[Gradle's build cache] is a very efficient mechanism to improve the overall build runtime, by reusing previously generated outputs (see link:https://docs.gradle.org/current/userguide/incremental_build.html[Incremental build] for technical details).
ja_jp: link:https://docs.gradle.org/current/userguide/build_cache.html[Gradleのビルドキャッシュ] は、以前に生成した出力を再利用することで、ビルド全体の実行時間を改善する非常に効率的な仕組みです（技術的な詳細は link:https://docs.gradle.org/current/userguide/incremental_build.html[Incremental build] を参照して下さい）。

source: link:https://docs.jboss.org/hibernate/orm/5.6/userguide/html_single/Hibernate_User_Guide.html#events[Hibernate Interceptors] are now supported in Quarkus. The link:/guides/hibernate-orm[Hibernate guide] provides all the necessary details.
ja_jp: link:https://docs.jboss.org/hibernate/orm/5.6/userguide/html_single/Hibernate_User_Guide.html#events[Hibernateインターセプター]がQuarkusでサポートされるようになりました。 link:/guides/hibernate-orm[Hibernateガイド]には必要な詳細が記載されています。

source: link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/userguide/html/Multipart.html[RESTEasy Multipart Provider]
ja_jp: link:https://docs.jboss.org/resteasy/docs/4.5.6.Final/userguide/html/Multipart.html[RESTEasyマルチパートプロバイダ]

source: link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing] is a JVM feature that helps reduce the startup time and memory footprint of a JVM application. This is achieved by having the JVM create a pre-processed shared archived of classes that are loaded at startup time. As these classes are loaded every time the application starts, AppCDS is a conceptually simple way of improving the application startup time, without the application itself having to be coded or configured in a specific way. How much of an improvement depends on many factors, such as the number of classes loaded, the underlying hardware etc.
ja_jp: link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[アプリケーション・クラス・データ共有] は 、JVMアプリケーションのスタートアップ時間とメモリ・フットプリントを削減するのに役立つJVM機能です。これは、JVMがスタートアップ時にロードされるクラスの事前処理された共有アーカイブを作成することによって達成されます。これらのクラスは、アプリケーションが起動するたびにロードされるので、AppCDSは、アプリケーション自体が特定の方法でコード化または構成される必要がなく、アプリケーションの起動時間を改善するコンセプト上、シンプルな方法です。どの程度改善されるかは、ロードされるクラスの数、基盤となるハードウェアなど、多くの要因に依存します。

source: link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[Application Class Data Sharing] is a JVM feature that helps reduce the startup time and memory footprint of a JVM application. This is achieved by having the JVM create a pre-processed shared archived of classes that are loaded at startup time. As these classes are loaded every time the application starts, AppCDS is a conceptually simple way of improving the application startup time, without the application itself having to be coded or configured in a specific way. How much of an improvement depends on many factors, such as the number of classes loaded, the underlying hardware, etc.
ja_jp: link:https://docs.oracle.com/en/java/javase/17/docs/specs/man/java.html#application-class-data-sharing[アプリケーション・クラス・データ共有] は、JVM アプリケーションの起動時間とメモリフットプリントを削減するのに役立つ JVM 機能です。これは、JVM が起動時にロードされるクラスの事前処理された共有アーカイブを作成することで実現されます。これらのクラスは、アプリケーションが起動するたびにロードされるため、AppCDS は、アプリケーション自体が特定の方法でコーディングまたは設定されることなく、アプリケーションの起動時間を改善する概念的にシンプルな方法です。どの程度の改善になるかは、ロードされるクラスの数、基盤となるハードウェアなど、多くの要因に依存します。

source: link:https://docs.quarkiverse.io/quarkus-artemis/dev/quarkus-artemis-jms.html[Artemis Core & JMS]
ja_jp: リンク:https://docs.quarkiverse.io/quarkus-artemis/dev/quarkus-artemis-jms.html[Artemis Core & JMS]

source: link:https://docs.quarkiverse.io/quarkus-google-cloud-services/main/pubsub.html[Google Cloud Pubsub]
ja_jp: リンク:https://docs.quarkiverse.io/quarkus-google-cloud-services/main/pubsub.html[Google Cloud Pubsub]

source: link:https://docs.quarkiverse.io/quarkus-hivemq-client/dev/index.html[HiveMQ Client]
ja_jp: リンク:https://docs.quarkiverse.io/quarkus-hivemq-client/dev/index.html[HiveMQ Client]

source: link:https://docs.quarkiverse.io/quarkus-rabbitmq-client/dev/index.html[RabbitMQ Client]
ja_jp: リンク:https://docs.quarkiverse.io/quarkus-rabbitmq-client/dev/index.html[RabbitMQ Client]

source: link:https://docs.spring.io/spring-security/reference/servlet/authorization/method-security.html#use-preauthorize[Authorizing Method Invocation with @PreAuthorize]
ja_jp: link:https://docs.spring.io/spring-security/reference/servlet/authorization/method-security.html#use-preauthorize[@PreAuthorizeによるメソッド呼び出しの認可]

source: link:https://docs.spring.io/spring-security/reference/servlet/authorization/method-security.html#use-secured[Authorizing Method Invocation with @Secured]
ja_jp: link:https://docs.spring.io/spring-security/reference/servlet/authorization/method-security.html#use-secured[@Securedによるメソッド呼び出しの認可]

source: link:https://download.eclipse.org/microprofile/microprofile-rest-client-1.4.1/microprofile-rest-client-1.4.1.html[MicroProfile Rest Client specification]
ja_jp: link:https://download.eclipse.org/microprofile/microprofile-rest-client-1.4.1/microprofile-rest-client-1.4.1.html[MicroProfile Rest Client仕様]

source: link:https://download.eclipse.org/microprofile/microprofile-rest-client-4.0/microprofile-rest-client-spec-4.0.html[MicroProfile Rest Client specification]
ja_jp: link:https://download.eclipse.org/microprofile/microprofile-rest-client-4.0/microprofile-rest-client-spec-4.0.html[MicroProfile Rest クライアント仕様]

source: link:https://en.wikipedia.org/wiki/Cross-origin_resource_sharing[Cross-origin resource sharing] (CORS) is a mechanism that allows restricted resources on a web page to be requested from another domain outside the domain from which the first resource was served.
ja_jp: link:https://en.wikipedia.org/wiki/Cross-origin_resource_sharing[クロスオリジンリソース共有] (CORS)は、ウェブページ上の制限されたリソースを、最初のリソースが提供されたドメイン以外の別のドメインから要求できるようにするメカニズムです。

source: link:https://en.wikipedia.org/wiki/Syslog[Syslog] is a protocol for sending log messages on Unix-like systems using a protocol defined by link:https://tools.ietf.org/html/rfc5424[RFC 5424].
ja_jp: link:https://en.wikipedia.org/wiki/Syslog[Syslogは] 、 link:https://tools.ietf.org/html/rfc5424[RFC 5424] で定義されたプロトコルを用いてUnix系システム上でログメッセージを送信するためのプロトコルです。

source: link:https://en.wikipedia.org/wiki/YAML[YAML] is widely used for defining resource descriptors, especially in Kubernetes.
ja_jp: link:https://en.wikipedia.org/wiki/YAML[YAML] は、特にKubernetesでリソース記述子を定義するために広く使用されています。

source: link:https://github.com/quarkiverse/quarkus-micrometer-registry[Quarkiverse extensions] (may be incomplete):
ja_jp: link:https://github.com/quarkiverse/quarkus-micrometer-registry[Quarkiverse エクステンション] (このリストは完全でない可能性あり):

source: link:https://github.com/quarkiverse[Quarkiverse Hub] is the GitHub organization that provides repository hosting (including build, CI and release publishing setup) for Quarkus extension projects contributed by the community.
ja_jp: link:https://github.com/quarkiverse[Quarkiverse Hub] は、コミュニティから投稿された Quarkus エクステンションプロジェクトのリポジトリーホスティング (ビルド、CI、リリースパブリッシングのセットアップを含む) を提供する GitHub 組織です。

source: link:https://github.com/smallrye/smallrye-context-propagation[SmallRye Context Propagation] an implementation of link:https://github.com/eclipse/microprofile-context-propagation[MicroProfile Context Propagation] was made to make those Quarkus extensions work properly in reactive/async settings. It works by capturing those contextual values that used to be in thread-locals, and restoring them when your code is called.
ja_jp: link:https://github.com/eclipse/microprofile-context-propagation[MicroProfile Context Propagation] の実装である link:https://github.com/smallrye/smallrye-context-propagation[SmallRye Context Propagation] は、リアクティブ/非同期設定でQuarkusエクステンションが正しく動作するようにするために作られました。これは、スレッドローカルにあったコンテキスト値を取得し、コードが呼び出されたときにそれらを復元することで動作します。

source: link:https://hibernate.org/reactive/[Hibernate Reactive] is a reactive API for Hibernate ORM, supporting non-blocking database drivers and a reactive style of interaction with the database.
ja_jp: link:https://hibernate.org/reactive/[Hibernate Reactive]は、Hibernate ORMのリアクティブAPIで、ノンブロッキングのデータベースドライバと、データベースとのインタラクションのリアクティブなスタイルをサポートしています。

source: link:https://hibernate.org/reactive/[Hibernate Reactive] is the only reactive JPA implementation and offers you the full breadth of an Object Relational Mapper allowing you to access your database over reactive drivers. It makes complex mappings possible, but it does not make simple and common mappings trivial. Hibernate Reactive with Panache focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: link:http://hibernate.org/reactive/[Hibernate Reactive] は唯一のリアクティブJPA実装であり、オブジェクトリレーショナルマッパーの全機能を提供し、リアクティブドライバを介してデータベースにアクセスすることができます。複雑なマッピングを可能にするだけでなく、単純で一般的なマッピングもおろそかにしていません。Panacheを使用したHibernate Reactiveは、Quarkusでエンティティを簡単に楽しく書けるようにすることに重点を置いています。

source: link:https://hibernate.org/reactive/[Hibernate Reactive] is the only reactive Jakarta Persistence (formerly known as JPA) implementation and offers you the full breadth of an Object Relational Mapper allowing you to access your database over reactive drivers. It makes complex mappings possible, but it does not make simple and common mappings trivial. Hibernate Reactive with Panache focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: link:https://hibernate.org/reactive/[Hibernate Reactive]は 、唯一のリアクティブ Jakarta Persistence（旧JPA）実装で、リアクティブドライバでデータベースにアクセスできるObject Relational Mapperの全機能を提供します。複雑なマッピングを可能にしますが、単純で一般的なマッピングを容易なものにするわけではありません。Hibernate Reactive with Panacheは、Quarkusでエンティティを簡単に、楽しく書けるようにすることに重点を置いています。

source: link:https://hub.quarkiverse.io.adoc[The Quarkiverse Hub documentation]
ja_jp: link:https://hub.quarkiverse.io.adoc[Quarkiverse Hub ドキュメント]

source: link:https://jreleaser.org/guide/latest/index.html[JReleaser] documentation.
ja_jp: link:https://jreleaser.org/guide/latest/index.html[JReleaser]のドキュメント

source: link:https://letsencrypt.org[Let's Encrypt] is a free, automated certificate authority provided by link:https://www.abetterinternet.org/[Internet Security Research Group].
ja_jp: link:https://letsencrypt.org[Let's Encrypt] は、link:https://www.abetterinternet.org/[Internet Security Research Group] が提供する無料の自動化された認証局です。

source: link:https://logging.apache.org/log4j/2.x/[Log4j] is a logging implementation: it contains a logging backend and a logging facade. Quarkus uses the JBoss Log Manager backend, so you will need to include the `log4j2-jboss-logmanager` library to route Log4j logs to JBoss Log Manager.
ja_jp: link:https://logging.apache.org/log4j/2.x/[Log4j] はロギングの実装の一つです: ロギングバックエンドとロギングファサードが含まれています。QuarkusはJBoss Log Managerバックエンドを使用するため、Log4jログをJBoss Log Managerにルーティングするためには `log4j2-jboss-logmanager` ライブラリをインクルードする必要があります。

source: link:https://ngrok.com/[ngrok] can be used to provide a secure HTTPS tunnel to your application running on localhost, and make it easy to test HTTPS based applications.
ja_jp: link:https://ngrok.com/[ngrok] を使用すると、ローカルホストで実行されているアプリケーションにセキュアな HTTPS トンネルを提供し、HTTPS ベースのアプリケーションを簡単にテストできるようになります。

source: link:https://ngrok.com/[ngrok] provides a secure HTTPS tunnel to an application running on localhost and helps you test HTTPS-based applications.
ja_jp: link:https://ngrok.com/[ngrok] は、ローカルホストで実行されているアプリケーションへのセキュアな HTTPS トンネルを提供し、HTTPS ベースのアプリケーションのテストを支援します。

source: link:https://openid.net/specs/openid-connect-backchannel-1_0.html[Back-Channel Logout] is used by OpenID Connect providers to log out the current user from all the applications this user is currently logged in, bypassing the user agent.
ja_jp: link:https://openid.net/specs/openid-connect-backchannel-1_0.html[バックチャンネルログアウト] は、OpenID Connect プロバイダーが、このユーザーが現在ログインしているすべてのアプリケーションから、ユーザーエージェントをバイパスして、現在のユーザーをログアウトするために使用されます。

source: link:https://openid.net/specs/openid-connect-frontchannel-1_0.html[Front-Channel Logout] can be used to logout the current user directly from the user agent.
ja_jp: link:https://openid.net/specs/openid-connect-frontchannel-1_0.html[フロントチャネルログアウト]は、ユーザーエージェントから直接、現在のユーザーをログアウトするために使用することができます。

source: link:https://quarkus.io/blog/kafka-avro/[How to Use Kafka, Schema Registry and Avro with Quarkus] - a blog post on which the guide is based. It gives a good introduction to Avro and the concept of schema registry
ja_jp: link:https://quarkus.io/blog/kafka-avro/[Quarkus での Kafka、Schema Registry、Avro の使用方法] - ガイドの基となるブログ投稿。Avro の紹介とスキーマレジストリーの概念について説明しています。

source: link:https://quarkus.io/guides/kafka-streams[Kafka Streams Extension]
ja_jp: リンク:https://quarkus.io/guides/kafka-streams[Kafka Streams エクステンション]

source: link:https://smallrye.io/smallrye-config/Main/config-sources/custom/[Additional Config Sources]
ja_jp: link:https://smallrye.io/smallrye-config/Main/config-sources/custom/[追加の設定ソース]

source: link:https://smallrye.io/smallrye-config/Main/config-sources/factories/[Config Source Factories]
ja_jp: link:https://smallrye.io/smallrye-config/Main/config-sources/factories/[設定ソースファクトリー]

source: link:https://smallrye.io/smallrye-config/Main/config/secret-keys/[Secret Keys]
ja_jp: link:https://smallrye.io/smallrye-config/Main/config/secret-keys/[シークレットキーズ]

source: link:https://smallrye.io/smallrye-config/Main/converters/custom/[Additional Converters]
ja_jp: link:https://smallrye.io/smallrye-config/Main/converters/custom/[追加コンバーター]

source: link:https://smallrye.io/smallrye-config/Main/extensions/fallback/[Fallback Configuration]
ja_jp: link:https://smallrye.io/smallrye-config/Main/extensions/fallback/[フォールバック設定]

source: link:https://smallrye.io/smallrye-config/Main/extensions/interceptors/[Interceptors]
ja_jp: link:https://smallrye.io/smallrye-config/Main/extensions/interceptors/[インターセプター]

source: link:https://smallrye.io/smallrye-config/Main/extensions/relocate/[Relocate Configuration]
ja_jp: link:https://smallrye.io/smallrye-config/Main/extensions/relocate/[移転設定]

source: link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/2.9/kafka/kafka.html[SmallRye Reactive Messaging Kafka] documentation
ja_jp: link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/2.9/kafka/kafka.html[SmallRye Reactive Messaging Kafka] ドキュメント

source: link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.4/kafka/kafka.html[SmallRye Reactive Messaging Kafka] documentation
ja_jp: link:https://smallrye.io/smallrye-reactive-messaging/smallrye-reactive-messaging/3.4/kafka/kafka.html[Kafka における SmallRye リアクティブメッセージング] のドキュメント

source: link:https://vertx.io/docs/vertx-core/java/#_verticles[Verticles] is "a simple, scalable, actor-like deployment and concurrency model" provided by _Vert.x_. This model does not claim to be a strict actor-model implementation, but it shares similarities, especially concerning concurrency, scaling, and deployment. To use this model, you write and _deploy_ verticles, communicating by sending messages on the event bus.
ja_jp: link:https://vertx.io/docs/vertx-core/java/#_verticles[Verticles] は、 _Vert.x_ が提供する「シンプルでスケーラブルな、アクターのようなデプロイ・並行性モデル」です。このモデルは、厳密なアクターモデルの実装を主張するものではありませんが、特に並行性、スケーリング、デプロイに関する類似性を共有しています。このモデルを使用するには、バーティクルを書いて _デプロイ_ し、イベントバスにメッセージを送信することで通信します。

source: link:https://www.keycloak.org/documentation.html[Keycloak Documentation]
ja_jp: link:https://www.keycloak.org/documentation.html[Keycloakドキュメンテーション]

source: link:https://www.keycloak.org/documentation.html[Keycloak documentation]
ja_jp: link:https://www.keycloak.org/documentation.html[Keycloak ドキュメント]

source: link:https://www.rfc-editor.org/rfc/rfc7523[RFC7523] explains how JWT Bearer tokens can be used to authenticate clients, see the link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[Using JWTs for Client Authentication] section for more information.
ja_jp: link:https://www.rfc-editor.org/rfc/rfc7523[RFC7523] では、JWT ベアラートークンを使用してクライアントを認証する方法について説明しています。詳細は、link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[クライアント認証での JWT の使用] セクションを参照してください。

source: link:https://www.rfc-editor.org/rfc/rfc7523[RFC7523] explains how JWT Bearer tokens can be used to authenticate clients. For more information, see the link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[Using JWTs for Client Authentication] section.
ja_jp: link:https://www.rfc-editor.org/rfc/rfc7523[RFC7523] では、JWT ベアラートークンを使用してクライアントを認証する方法について説明しています。詳細は、link:https://www.rfc-editor.org/rfc/rfc7523#section-2.2[クライアント認証での JWT の使用] セクションを参照してください。

source: link:{http-websocket-connector}[Reactive HTTP and WebSocket Connector]
ja_jp: link:{http-websocket-connector}[Reactive HTTP および WebSocket Connector]

source: link:{https://quarkus.io/guides/building-native-image}[GraalVM installed] if you want to run in native mode
ja_jp: link:{https://quarkus.io/guides/building-native-image} [GraalVM がインストールされている] (ネイティブモードで実行する場合)

source: link:{jaxrsapi}/jakarta/ws/rs/core/Application.html[`Application`]
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/core/Application.html[`アプリケーション`]

source: link:{jaxrsapi}/jakarta/ws/rs/core/Request.html[`Request`]
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/core/Request.html[`リクエスト`]

source: link:{jaxrsapi}/jakarta/ws/rs/ext/Providers.html[`Providers`]
ja_jp: link:{jaxrsapi}/jakarta/ws/rs/ext/Providers.html[`プロバイダー`]

source: link:{jdkapi}/java/util/List.html[`List<T>`], link:{jdkapi}/java/util/Set.html[`Set<T>`], or link:{jdkapi}/java/util/SortedSet.html[`SortedSet<T>`], where `T` satisfies 1, 3 or 4 above.
ja_jp: link:{jdkapi}/java/util/List.html[`List<T>`]、link:{jdkapi}/java/util/Set.html[`Set<T>`]、または link:{jdkapi}/java/util/SortedSet.html[`SortedSet<T>`]。ただし、`T` は上記の 1、3、または 4 を満たすものとします。

source: link:{jdkapi}/java/util/List.html[`List<T>`], link:{jdkapi}/java/util/Set.html[`Set<T>`], or link:{jdkapi}/java/util/SortedSet.html[`SortedSet<T>`], where `T` satisfies any above criterion.
ja_jp: link:{jdkapi}/java/util/List.html[`List<T>`]、link:{jdkapi}/java/util/Set.html[`Set<T>`]、または link:{jdkapi}/java/util/SortedSet.html[`SortedSet<T>`]。ここで `T` は上記の基準を満たします。

source: link:{jdkapi}/java/util/Optional.html[`Optional<RestResponse<?>>`] or link:{jdkapi}/java/util/Optional.html[`Optional<Response>`]
ja_jp: link:{jdkapi}/java/util/Optional.html[`Optional<RestResponse<?>>`] または link:{jdkapi}/java/util/Optional.html[`Optional<Response>`]

source: link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse<?>>`] or link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<Response>`]
ja_jp: link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse<?>>`] または link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<Response>`]
